# DimWitnsLineExtensionBelow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimWitnsLineExtensionBelow Property
ParameterTypeId Class See Also
---
"Witness Line Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimWitnsLineExtensionBelow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimWitnsLineExtensionBelow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimWitnsLineExtensionBelow {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace